homework2-jmeter/GRPC Request.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group">
        <intProp name="ThreadGroup.num_threads">100</intProp>
        <intProp name="ThreadGroup.ramp_time">30</intProp>
        <longProp name="ThreadGroup.duration">30</longProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="/search">
          <stringProp name="GRPCSampler.protoFolder">/home/krava/Projects/GoProjects/OTUS/homework/homework-backend/internal/proto</stringProp>
          <stringProp name="GRPCSampler.libFolder">/home/krava/Projects/GoProjects/OTUS/homework/build/debug</stringProp>
          <stringProp name="GRPCSampler.host">localhost</stringProp>
          <stringProp name="GRPCSampler.port">9001</stringProp>
          <stringProp name="GRPCSampler.fullMethod">proto.AuthorizationService/UsersGetByPrefixFirstNameAndSecondName</stringProp>
          <stringProp name="GRPCSampler.deadline">1000000</stringProp>
          <boolProp name="GRPCSampler.tls">false</boolProp>
          <boolProp name="GRPCSampler.tlsDisableVerification">false</boolProp>
          <stringProp name="GRPCSampler.channelAwaitTermination">1000000</stringProp>
          <stringProp name="GRPCSampler.maxInboundMessageSize">419430400</stringProp>
          <stringProp name="GRPCSampler.maxInboundMetadataSize">819200</stringProp>
          <stringProp name="GRPCSampler.requestJson">{
	&quot;first_name&quot;:${__RandomString(1,АБВГДЕЖЗИКЛМНОПРСТУ,)},
	&quot;second_name&quot;:${__RandomString(1,АБВГДЕЖЗИКЛМНОПРСТУ,)}
}</stringProp>
        </vn.zalopay.benchmark.GRPCSampler>
        <hashTree/>
        <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="/searchById">
          <stringProp name="GRPCSampler.protoFolder">/home/krava/Projects/GoProjects/OTUS/homework/homework-backend/internal/proto</stringProp>
          <stringProp name="GRPCSampler.libFolder">/home/krava/Projects/GoProjects/OTUS/homework/build/debug</stringProp>
          <stringProp name="GRPCSampler.host">localhost</stringProp>
          <stringProp name="GRPCSampler.port">9001</stringProp>
          <stringProp name="GRPCSampler.fullMethod">proto.AuthorizationService/UserGetById</stringProp>
          <stringProp name="GRPCSampler.deadline">1000000</stringProp>
          <boolProp name="GRPCSampler.tls">false</boolProp>
          <boolProp name="GRPCSampler.tlsDisableVerification">false</boolProp>
          <stringProp name="GRPCSampler.channelAwaitTermination">1000000</stringProp>
          <stringProp name="GRPCSampler.maxInboundMessageSize">419430400</stringProp>
          <stringProp name="GRPCSampler.maxInboundMetadataSize">819200</stringProp>
          <stringProp name="GRPCSampler.requestJson">{
	&quot;user_id&quot;:${__UUID}
}</stringProp>
        </vn.zalopay.benchmark.GRPCSampler>
        <hashTree/>
        <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="/SLAVE-search" enabled="false">
          <stringProp name="GRPCSampler.protoFolder">/home/krava/Projects/GoProjects/OTUS/homework/homework-backend/internal/proto</stringProp>
          <stringProp name="GRPCSampler.libFolder">/home/krava/Projects/GoProjects/OTUS/homework/build/debug</stringProp>
          <stringProp name="GRPCSampler.host">localhost</stringProp>
          <stringProp name="GRPCSampler.port">9002</stringProp>
          <stringProp name="GRPCSampler.fullMethod">proto.AuthorizationService/UsersGetByPrefixFirstNameAndSecondName</stringProp>
          <stringProp name="GRPCSampler.deadline">1000000</stringProp>
          <boolProp name="GRPCSampler.tls">false</boolProp>
          <boolProp name="GRPCSampler.tlsDisableVerification">false</boolProp>
          <stringProp name="GRPCSampler.channelAwaitTermination">1000000</stringProp>
          <stringProp name="GRPCSampler.maxInboundMessageSize">419430400</stringProp>
          <stringProp name="GRPCSampler.maxInboundMetadataSize">819200</stringProp>
          <stringProp name="GRPCSampler.requestJson">{
	&quot;first_name&quot;:${__RandomString(1,АБВГДЕЖЗИКЛМНОПРСТУ,)},
	&quot;second_name&quot;:${__RandomString(1,АБВГДЕЖЗИКЛМНОПРСТУ,)}
}</stringProp>
        </vn.zalopay.benchmark.GRPCSampler>
        <hashTree/>
        <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="/SLAVE-searchById" enabled="false">
          <stringProp name="GRPCSampler.protoFolder">/home/krava/Projects/GoProjects/OTUS/homework/homework-backend/internal/proto</stringProp>
          <stringProp name="GRPCSampler.libFolder">/home/krava/Projects/GoProjects/OTUS/homework/build/debug</stringProp>
          <stringProp name="GRPCSampler.host">localhost</stringProp>
          <stringProp name="GRPCSampler.port">9002</stringProp>
          <stringProp name="GRPCSampler.fullMethod">proto.AuthorizationService/UserGetById</stringProp>
          <stringProp name="GRPCSampler.deadline">1000000</stringProp>
          <boolProp name="GRPCSampler.tls">false</boolProp>
          <boolProp name="GRPCSampler.tlsDisableVerification">false</boolProp>
          <stringProp name="GRPCSampler.channelAwaitTermination">1000000</stringProp>
          <stringProp name="GRPCSampler.maxInboundMessageSize">419430400</stringProp>
          <stringProp name="GRPCSampler.maxInboundMetadataSize">819200</stringProp>
          <stringProp name="GRPCSampler.requestJson">{
	&quot;user_id&quot;:${__UUID}
}</stringProp>
        </vn.zalopay.benchmark.GRPCSampler>
        <hashTree/>
        <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="/userRegister" enabled="false">
          <stringProp name="GRPCSampler.protoFolder">/home/krava/Projects/GoProjects/OTUS/homework/homework-backend/internal/proto</stringProp>
          <stringProp name="GRPCSampler.libFolder">/home/krava/Projects/GoProjects/OTUS/homework/build/debug</stringProp>
          <stringProp name="GRPCSampler.host">localhost</stringProp>
          <stringProp name="GRPCSampler.port">9001</stringProp>
          <stringProp name="GRPCSampler.fullMethod">proto.AuthorizationService/UserRegister</stringProp>
          <stringProp name="GRPCSampler.deadline">100000</stringProp>
          <boolProp name="GRPCSampler.tls">false</boolProp>
          <boolProp name="GRPCSampler.tlsDisableVerification">false</boolProp>
          <stringProp name="GRPCSampler.channelAwaitTermination">100000</stringProp>
          <stringProp name="GRPCSampler.maxInboundMessageSize">41943040</stringProp>
          <stringProp name="GRPCSampler.maxInboundMetadataSize">81920</stringProp>
          <stringProp name="GRPCSampler.requestJson">{
	&quot;first_name&quot;:${__RandomString(1,АБВГДЕЖЗИКЛМНОПРСТУ,)},
	&quot;second_name&quot;:${__RandomString(1,АБВГДЕЖЗИКЛМНОПРСТУ,)},
	&quot;birthdate&quot;:&quot;1945-09-09&quot;,
	&quot;biography&quot;:${__RandomString(1,АБВГДЕЖЗИКЛМНОПРСТУ,)},
	&quot;city&quot;:${__RandomString(1,АБВГДЕЖЗИКЛМНОПРСТУ,)},
	&quot;password&quot;:&quot;password&quot;
}</stringProp>
        </vn.zalopay.benchmark.GRPCSampler>
        <hashTree/>
        <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="/SLAVE-userRegister" enabled="false">
          <stringProp name="GRPCSampler.protoFolder">/home/krava/Projects/GoProjects/OTUS/homework/homework-backend/internal/proto</stringProp>
          <stringProp name="GRPCSampler.libFolder">/home/krava/Projects/GoProjects/OTUS/homework/build/debug</stringProp>
          <stringProp name="GRPCSampler.host">localhost</stringProp>
          <stringProp name="GRPCSampler.port">9002</stringProp>
          <stringProp name="GRPCSampler.fullMethod">proto.AuthorizationService/UserRegister</stringProp>
          <stringProp name="GRPCSampler.deadline">100000</stringProp>
          <boolProp name="GRPCSampler.tls">false</boolProp>
          <boolProp name="GRPCSampler.tlsDisableVerification">false</boolProp>
          <stringProp name="GRPCSampler.channelAwaitTermination">100000</stringProp>
          <stringProp name="GRPCSampler.maxInboundMessageSize">41943040</stringProp>
          <stringProp name="GRPCSampler.maxInboundMetadataSize">81920</stringProp>
          <stringProp name="GRPCSampler.requestJson">{
	&quot;first_name&quot;:${__RandomString(1,АБВГДЕЖЗИКЛМНОПРСТУ,)},
	&quot;second_name&quot;:${__RandomString(1,АБВГДЕЖЗИКЛМНОПРСТУ,)},
	&quot;birthdate&quot;:&quot;1945-09-09&quot;,
	&quot;biography&quot;:${__RandomString(1,АБВГДЕЖЗИКЛМНОПРСТУ,)},
	&quot;city&quot;:${__RandomString(1,АБВГДЕЖЗИКЛМНОПРСТУ,)},
	&quot;password&quot;:&quot;password&quot;
}</stringProp>
        </vn.zalopay.benchmark.GRPCSampler>
        <hashTree/>
        <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="/userLogin" enabled="false">
          <stringProp name="GRPCSampler.protoFolder">/home/krava/GoProjects/OTUS/homework/homework-backend/internal/proto</stringProp>
          <stringProp name="GRPCSampler.libFolder">/home/krava/GoProjects/OTUS/homework/build/debug</stringProp>
          <stringProp name="GRPCSampler.host">localhost</stringProp>
          <stringProp name="GRPCSampler.port">9001</stringProp>
          <stringProp name="GRPCSampler.fullMethod">proto.AuthorizationService/UserLogin</stringProp>
          <stringProp name="GRPCSampler.deadline">100000</stringProp>
          <boolProp name="GRPCSampler.tls">false</boolProp>
          <boolProp name="GRPCSampler.tlsDisableVerification">false</boolProp>
          <stringProp name="GRPCSampler.channelAwaitTermination">100000</stringProp>
          <stringProp name="GRPCSampler.maxInboundMessageSize">41943040</stringProp>
          <stringProp name="GRPCSampler.maxInboundMetadataSize">81920</stringProp>
          <stringProp name="GRPCSampler.requestJson">{
	&quot;user_id&quot;:&quot;05886670-90a7-4850-a385-62d7e7f175e7&quot;,
	&quot;password&quot;:&quot;password&quot;
}</stringProp>
        </vn.zalopay.benchmark.GRPCSampler>
        <hashTree/>
        <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="/search/kravtsova" enabled="false">
          <stringProp name="GRPCSampler.protoFolder">/home/krava/GoProjects/OTUS/homework/homework-backend/internal/proto</stringProp>
          <stringProp name="GRPCSampler.libFolder">/home/krava/Distrib/jmeter</stringProp>
          <stringProp name="GRPCSampler.host">localhost</stringProp>
          <stringProp name="GRPCSampler.port">9001</stringProp>
          <stringProp name="GRPCSampler.fullMethod">proto.AuthorizationService/UsersGetByPrefixFirstNameAndSecondName</stringProp>
          <stringProp name="GRPCSampler.deadline">10000</stringProp>
          <boolProp name="GRPCSampler.tls">false</boolProp>
          <boolProp name="GRPCSampler.tlsDisableVerification">false</boolProp>
          <stringProp name="GRPCSampler.channelAwaitTermination">10000</stringProp>
          <stringProp name="GRPCSampler.maxInboundMessageSize">4194304</stringProp>
          <stringProp name="GRPCSampler.maxInboundMetadataSize">8192</stringProp>
          <stringProp name="GRPCSampler.requestJson">{
	&quot;first_name&quot;:&quot;А&quot;,
	&quot;second_name&quot;:&quot;К&quot;
}</stringProp>
        </vn.zalopay.benchmark.GRPCSampler>
        <hashTree/>
        <ResultCollector guiclass="StatGraphVisualizer" testclass="ResultCollector" testname="Aggregate Graph" enabled="false">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="JDBC Request" enabled="false">
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="false">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.ThreadsStateOverTimeGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="jp@gc - Active Threads Over Time" enabled="false">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <longProp name="interval_grouping">500</longProp>
        <boolProp name="graph_aggregated">false</boolProp>
        <boolProp name="include_checkbox_state">false</boolProp>
        <boolProp name="exclude_checkbox_state">false</boolProp>
      </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
      <hashTree/>
      <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.ResponseTimesOverTimeGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="jp@gc - Response Times Over Time">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <longProp name="interval_grouping">500</longProp>
        <boolProp name="graph_aggregated">false</boolProp>
        <boolProp name="include_checkbox_state">false</boolProp>
        <boolProp name="exclude_checkbox_state">false</boolProp>
      </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
      <hashTree/>
      <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.TransactionsPerSecondGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="jp@gc - Transactions per Second" enabled="false">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <longProp name="interval_grouping">1000</longProp>
        <boolProp name="graph_aggregated">false</boolProp>
        <boolProp name="include_checkbox_state">false</boolProp>
        <boolProp name="exclude_checkbox_state">false</boolProp>
      </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
      <hashTree/>
      <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.BytesThroughputOverTimeGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="jp@gc - Bytes Throughput Over Time" enabled="false">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <longProp name="interval_grouping">1000</longProp>
        <boolProp name="graph_aggregated">false</boolProp>
        <boolProp name="include_checkbox_state">false</boolProp>
        <boolProp name="exclude_checkbox_state">false</boolProp>
      </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
      <hashTree/>
      <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.LatenciesOverTimeGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="jp@gc - Response Latencies Over Time" enabled="false">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <longProp name="interval_grouping">500</longProp>
        <boolProp name="graph_aggregated">false</boolProp>
        <boolProp name="include_checkbox_state">false</boolProp>
        <boolProp name="exclude_checkbox_state">false</boolProp>
      </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
      <hashTree/>
      <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.TransactionsPerSecondGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="jp@gc - Transactions per Second">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <longProp name="interval_grouping">1000</longProp>
        <boolProp name="graph_aggregated">false</boolProp>
        <boolProp name="include_checkbox_state">false</boolProp>
        <boolProp name="exclude_checkbox_state">false</boolProp>
      </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
      <hashTree/>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="false">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>